ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_wadi_config_regs.xml
<module id="WADI_CONFIG_REGS" HW_revision="" description="WADI CONFIG Registers">
	<register id="BLKCFG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="WADI Block Clock Divider">
		<bitfield id="CLKEN" description="Enables clock for WADI block" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SIG1IN" description="Selects the input signal for the SIG1 input of WADI block" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SIG2IN" description="Selects the input signal for the SIG2 input of WADI block" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="TRIG1IN" description="Selects trigger input signal for SIG1 analysis" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="TRIG2IN" description="Selects  trigger input signal for SIG2 analysis" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SIGTOSIGCFG" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Configuration for SIG1 to SIG2 comparison for WADI Block  ">
		<bitfield id="CMP" description="Compare value for difference of width/sum measurement" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="CMPMARGIN" description="Margin of error for difference of width/sum measurement" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_CMPEN" description="Enables the signal to signal compare" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_DBCMPEN" description="Enables the deadband check between two signals" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_OLAPCMPEN" description="Enables the overlap check between two signals" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="DBCMPTYPE" description="Selects the check type for deadband control" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="OLAPCMPTYPE" description="Selects the check type for overlap control" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="SIGTOSIG_PKCFG" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Signal1 to Signal2 peak comparison value and margin for WADI Block  ">
		<bitfield id="PKCMP" description="Compare value for difference of peak measurement" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="PKCMPMARGIN" description="Margin of error for difference of peak measurement" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIGTOSIG_AVGCFG" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Signal1 to Signal2 average comparison value and margin for WADI Block  ">
		<bitfield id="AVGCMP" description="Compare difference for measurements average of both signals" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="AVGCMPMARGIN" description="Margin for difference of average of both signals" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIGTOSIG_DBOLAPA" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Signal1 to Signal2 dead-band comparison difference and margin for WADI Block  ">
		<bitfield id="DBCMPA" description="Compare value for dead-band between both signals" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OLAPCMPA" description="Compare value for Overlap between both signal levels" begin="23" end="8" width="16" rwaccess="RW"/>
		<bitfield id="OLAPCMPAMARGIN" description="Margin of variation of overlap between both signals" begin="29" end="24" width="6" rwaccess="RW"/>
	</register>
	<register id="SIGTOSIG_DBOLAPB" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Signal1 to Signal2 dead-band and Overlap compare values for WADI Block  ">
		<bitfield id="DBCMPB" description="Compare value for dead-band between both signals" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OLAPCMPB" description="Compare value for Overlap between both signal levels" begin="23" end="8" width="16" rwaccess="RW"/>
		<bitfield id="OLAPCMPBMARGIN" description="Margin of variation of overlap between both signals" begin="29" end="24" width="6" rwaccess="RW"/>
	</register>
	<register id="BLKTRIGCFG" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="The trigger configuration for SIG1 and SIG2 of the WADI Block">
		<bitfield id="TRIG1TYPE" description="The trigger type for SIG1 signal input." begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TRIG1SWEN" description="Software trigger for the SIG1" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIG2TYPE" description="The trigger type for SIG2 signal input." begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="TRIG2SWEN" description="Software trigger for the SIG2" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="SIG1CFG" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Measurement configuration for SIG1 of WADI Block  ">
		<bitfield id="SIGPOL" description="Starting edge select as rise, fall or either" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EDGESPAN" description="Defines span of edges of given type to measure the width. " begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="NUMAGGR" description="Defines number of measurements to be aggregated " begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="AGGRMODE" description="Whether peak or average or both measurements to compute" begin="25" end="24" width="2" rwaccess="RW"/>
	</register>
	<register id="SIG1CMPA" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Envelope-1 compare value and margin for SIG1 for WADI Block  ">
		<bitfield id="CMPA" description="Compare A value for measured count of the SIG1" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPAMARGIN" description="+/- Margin for compare-1 around SIG1CMPA[CMPA]" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG1CMPB" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Envelope-2 compare value and margin for SIG1 for WADI Block  ">
		<bitfield id="CMPB" description="Compare B value for measured count of the SIG1" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPBMARGIN" description="+/- Margin for compare B around SIG1CMPB[CMPB]" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG1PKCFG" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="Peak of the aggregation compare configuration for  SIG1 of WADI Block  ">
		<bitfield id="CMP" description="Compare value for peak measurements of SIG1" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPMARGIN" description="Margin of variation for peak measurements of SIG1" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG1AVGCFG" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="Average of the aggregation comparison configuration for SIG1 of WADI Block  ">
		<bitfield id="CMP" description="Compare value for average of measurements of SIG1" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPMARGIN" description="Margin for average of measurements of SIG1" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG1EDGECFG" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Frequency measurement  configuration for SIG1 of WADI Block  ">
		<bitfield id="TIMEWNDOW" description="Time window to count edges of SIG1" begin="27" end="0" width="28" rwaccess="RW"/>
		<bitfield id="CNTEN" description="SIG1 Edge count mode enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SIG1EDGEMVWCFG" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Moving Window Configuration for SIG1 of WADI Block">
		<bitfield id="MVWTIME" description="Moving Window time" begin="25" end="0" width="26" rwaccess="RW"/>
		<bitfield id="MVWCNT" description="Moving window count:number of MWVTIME windows to accumulate" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MVWEN" description="Moving window operation enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SIG2CFG" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Measurement configuration for SIG2 of WADI Block  ">
		<bitfield id="SIGPOL" description="Starting edge select as rise, fall or either" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EDGESPAN" description="Defines span of edges of given type to measure the width. " begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="NUMAGGR" description="Defines number of measurements to be aggregated " begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="AGGRMODE" description="Whether peak or average or both measurements to compute" begin="25" end="24" width="2" rwaccess="RW"/>
	</register>
	<register id="SIG2CMPA" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Compare value A and +/- margin for SIG2 for WADI Block  ">
		<bitfield id="CMPA" description="Compare A value for measured count of the SIG2" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPAMARGIN" description="+/- Margin for compare-1 around SIG2CMPA[CMPA]" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG2CMPB" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Compare value B and +/- margin for SIG2 for WADI Block  ">
		<bitfield id="CMPB" description="Compare B value for measured count of the SIG2" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPBMARGIN" description="+/- Margin for compare B around SIG2CMPB[CMPB]" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG2PKCFG" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="Peak of the aggregation compare configuration for  SIG2 of WADI Block  ">
		<bitfield id="CMP" description="Compare value for peak measurements of SIG2" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPMARGIN" description="Margin of variation for peak measurements of SIG2" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG2AVGCFG" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Average of the aggregation comparison configuration for SIG2 of WADI Block  ">
		<bitfield id="CMP" description="Compare value for average of measurements of SIG2" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="CMPMARGIN" description="Margin for average of measurements of SIG2" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SIG2EDGECFG" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Frequency measurement  configuration for SIG2 of WADI Block  ">
		<bitfield id="TIMEWNDOW" description="Time window to count edges of SIG2" begin="27" end="0" width="28" rwaccess="RW"/>
		<bitfield id="CNTEN" description="SIG2 Edge count mode enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SIG2EDGEMVWCFG" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Moving Window Configuration for SIG2 of WADI Block">
		<bitfield id="MVWTIME" description="Moving Window time" begin="25" end="0" width="26" rwaccess="RW"/>
		<bitfield id="MVWCNT" description="Moving window count:number of MWVTIME windows to accumulate" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MVWEN" description="Moving window operation enable" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="BLKERRSTS" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="Block status register">
		<bitfield id="SIG1CMPAERR" description="Compare A margin error for the SIG1 measurements" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SIG1PKERR" description="Error of SIG1 peak measurements" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SIG1AVGERR" description="Average of aggregation error for the SIG1 measurements" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIG1CMPBERR" description="Compare B margin error for the SIG1 measurements" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SIG2CMPAERR" description="Compare A margin error for the SIG2 measurements" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SIG2PKERR" description="Error of SIG2 peak measurements" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SIG2AVGERR" description="Average of aggregation error for the SIG2 measurements" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SIG2CMPBERR" description="Compare B margin error for the SIG2 measurements" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_CMPERR" description="Compare error for the SIGTOSIG measurements difference" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_PKERR" description="Error of SIGTOSIG peak measurements difference" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_AVGERR" description="Average error for the SIGTOSIG measurements difference" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_DBCMPAERR" description="Deadband Compare A error for the SIGTOSIG measurements" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_DBCMPBERR" description="Deadband Compare B Error for the SIGTOSIG measurements" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_OLAPCMPAERR" description="Overlap check Compare A error of SIGTOSIG measurements" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_OLAPCMPBERR" description="Overlap check Compare B error of SIGTOSIG measurements" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SIG_ERR" description="Measurement error of unexpected waveform anomaly " begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SIGTOSIG_ERR" description="Mismatch in number of readings between signals" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="BLKERRINFO" width="32" page="0" offset="0xc4" instances="1" instaddr="4" internal="0" description="Block count value of failed register">
		<bitfield id="ERRCNT" description="First failed count of SIGx multiplexed  to this register" begin="24" end="0" width="25" rwaccess="R"/>
		<bitfield id="ERRTYPE" description="Type of error of the registered count" begin="30" end="28" width="3" rwaccess="R"/>
	</register>
	<register id="BLKERRCFG" width="32" page="0" offset="0xc8" instances="1" instaddr="4" internal="0" description="Block Debug additional info.">
		<bitfield id="ERRCNTSEL" description="Selects the count to be multiplexed for debug" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="OVERIDESIG1" description="Drives the signal correction for outputting the SIG1" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="OVERIDESIG2" description="Drives the signal correction for outputting the SIG2" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="OVERIDESIGTOSIG" description="Drives the correction to both signals if SIGTOSIG error" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="SSS_EVTMASK" width="32" page="0" offset="0xcc" instances="1" instaddr="4" internal="0" description="Mask to combine Block errors for trigger of SSS in event word Output by WADI block">
		<bitfield id="SIG1MASK" description="Mask for specific WADI events to SSS event word or not" begin="14" end="0" width="15" rwaccess="RW"/>
		<bitfield id="SIG2MASK" description="Mask for specific WADI events to SSS event word or not" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="PARTEST" width="32" page="0" offset="0xe8" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
